rails/haris_ahmed_reddit_clone/app/models/post.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
        def comments_by_parent
            comments_by_parent = Hash.new { |hash, key| hash[key] = [] }

            self.comments.includes(:author).each do |comment|