rails/haris_ahmed_reddit_clone/app/models/user.rb

SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "E2tc_SmepDmH-dI81XTm5g"], ["LIMIT", 1]]
---
    def self.generate_session_token
        token = SecureRandom::urlsafe_base64(16)
        while self.exists?(session_token: token)

SELECT  1 AS one FROM "users" WHERE "users"."activation_token" = $1 LIMIT $2  [["activation_token", "bgZ935lsFKwMAdh3FfuoBQ"], ["LIMIT", 1]]
---
    def self.generate_activation_token
        token = SecureRandom::urlsafe_base64(16)
        while self.exists?(activation_token: token)