rails/haris_ahmed_99_cats/app/models/cat_rental_request.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2020-07-16' OR end_date < '2020-07-05') AND "cat_rental_requests"."status" = $3  [["id", 3], ["cat_id", 1], ["status", "PENDING"]]
---
    def overlapping_pending_requests
        overlapping_requests.where(status: 'PENDING')

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2021-08-05 16:48:37.649494"], ["id", 3]]
---
    def approve!
        raise 'not pending' unless self.status == 'PENDING'

        transaction do
            self.status = 'APPROVED'
            self.save!