rails/haris_ahmed_music_app/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def index
        if params.has_key?(:band_id)
            @band = Band.find_by(id: params[:band_id])