rails/haris_ahmed_music_app/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def new
        @band = Band.find_by(id: params[:band_id])

INSERT INTO "albums" ("title", "year", "live", "created_at", "updated_at", "band_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test_album6"], ["year", 2010], ["live", false], ["created_at", "2021-08-30 13:57:24.897853"], ["updated_at", "2021-08-30 13:57:24.897853"], ["band_id", 6]]
---
    def create
        @album = Album.new(album_params)
        @band = @album.band

        if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @album = Album.find_by(id: params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "albums" SET "live" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["live", true], ["updated_at", "2021-08-27 23:14:27.461039"], ["id", 5]]
---
    def update
        @album = Album.find_by(id: params[:id])

        if @album.update_attributes(album_params)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 3]]
---
    def destroy
        @album = Album.find_by(id: params[:id])

        if @album
            @album.destroy