rails/haris_ahmed_music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "test_band_new"], ["updated_at", "2021-08-26 14:45:54.210969"], ["id", 1]]
---
    def update
        @band = Band.find_by(id: params[:id])

        if @band.update_attributes(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 6]]
---
    def destroy
        @band = Band.find_by(id: params[:id])

        if @band
            @band.destroy