rails/haris_ahmed_music_app/app/controllers/notes_controller.rb

    def create
        @note = Note.new(note_params)
        @note.user_id = current_user.id

        if @note.save
---
INSERT INTO "notes" ("track_id", "user_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["track_id", 1], ["user_id", 4], ["message", "            \r\n        love this"], ["created_at", "2021-09-01 16:25:19.988172"], ["updated_at", "2021-09-01 16:25:19.988172"]]

    def destroy
        @note = Note.find_by(id: params[:id])
        track = @note.track_id

        if @note
            @note.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 3]]