rails/haris_ahmed_music_app/app/controllers/tracks_controller.rb

    def create
        @track = Track.new(track_params)

        if @track.save
---
INSERT INTO "tracks" ("title", "ord", "lyrics", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Pengis mission"], ["ord", 1], ["lyrics", "            \r\n        "], ["album_id", 7], ["created_at", "2021-09-01 16:27:22.234952"], ["updated_at", "2021-09-01 16:27:22.234952"]]

    def new
        @album = Album.find_by(id: params[:album_id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def edit
        @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def show
        @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
        @track = Track.find_by(id: params[:id])

        if @track
            @track.destroy
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 2]]