rails/haris_ahmed_music_app/app/controllers/users_controller.rb

    def update
        @user = User.find_by(id: params[:id])
        @user.toggle(:administrator)
        @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "activation_token_1" = $1, "administrator" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["activation_token_1", "0FKu58E-blpkl86IwMip_g"], ["administrator", true], ["updated_at", "2021-09-07 16:34:20.958162"], ["id", 4]]