rails/haris_ahmed_art_share/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
    def index
        #render json: Artwork.all

        owned_artworks = User.find(params[:user_id]).artworks
        shared_with_artworks = User.find(params[:user_id]).shared_artworks

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "testart4"], ["image_url", "testart4.com"], ["artist_id", 16], ["updated_at", "2021-07-22 19:42:22.356622"], ["id", 15]]
---
    def update
        artwork = Artwork.find(params[:id])

        if artwork.update(artwork_params)