rails/haris_ahmed_art_share/app/controllers/comments_controller.rb

    def index
        case
        when params[:user_id]
            comments = Comment.where(user_id: params[:user_id])
        when params[:artwork_id]
            comments = Comment.where(artwork_id: params[:artwork_id])
        else
            comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 15]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 16]]
SELECT "comments".* FROM "comments"

    def create
        comment = Comment.new(comment_params)

        if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 17], ["artwork_id", 16], ["body", "This is a test comment"], ["created_at", "2021-07-27 14:34:49.640426"], ["updated_at", "2021-07-27 14:34:49.640426"]]

    def destroy
        comment = Comment.find(params[:id])

        if comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]