rails/haris_ahmed_goal_tracker/app/models/user.rb

SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "vs73mZ4WMhzfcoP9LRTaRQ"], ["LIMIT", 1]]
---
    def self.generate_session_token
        token = SecureRandom::urlsafe_base64(16)
        while self.exists?(session_token: token)

SELECT  1 AS one FROM "users" WHERE "users"."activation_token" = $1 AND "users"."id" != $2 LIMIT $3  [["activation_token", "-qO_2jE3-hSUAbSWJNxP4A"], ["id", 1], ["LIMIT", 1]]
---
    def self.generate_unique_activation_token
        token = SecureRandom.urlsafe_base64(16)
        while self.exists?(activation_token: token)