rails/haris_ahmed_music_app/app/models/user.rb

    def self.generate_session_token
        token = SecureRandom::urlsafe_base64(16)
        while self.exists?(session_token: token)
---
SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "3UFfPRzExYI0FwEJdrB9Sg"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "activation_token_1" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["session_token", "3UFfPRzExYI0FwEJdrB9Sg"], ["activation_token_1", "DcJxg8SOpxIpzdV6wgN6Lg"], ["updated_at", "2021-09-07 14:10:13.549129"], ["id", 3]]

    def generate_unique_activation_token
        token = SecureRandom.urlsafe_base64(16)
        while self.class.exists?(activation_token_1: token)
---
SELECT  1 AS one FROM "users" WHERE "users"."activation_token_1" = $1 LIMIT $2  [["activation_token_1", "DcJxg8SOpxIpzdV6wgN6Lg"], ["LIMIT", 1]]