sql/haris_ahmed_url_shortener/app/models/shortened_url.rb

    def self.random_code
        good_url = false

        until good_url
            url = SecureRandom.urlsafe_base64
            unless ShortenedUrl.exists?(short_url: url)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "Fqi2Hf-Yyll3tiF3tH6TTw"], ["LIMIT", 1]]

    def self.create_short_url(user, long_url)
        url = ShortenedUrl.random_code
        ShortenedUrl.create!(long_url: long_url, short_url: url, user_id: user.id)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "https://www.test2.com"], ["short_url", "Fqi2Hf-Yyll3tiF3tH6TTw"], ["user_id", 1], ["created_at", "2021-06-25 14:55:35.317464"], ["updated_at", "2021-06-25 14:55:35.317464"]]