sql/haris_ahmed_url_shortener/app/models/visit.rb

    def self.record_visit!(user, shortened_url)
        Visit.create!(user_id: user.id, short_url_id: shortened_url.id)
---
INSERT INTO "visits" ("user_id", "short_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["short_url_id", 4], ["created_at", "2021-06-25 15:12:43.065423"], ["updated_at", "2021-06-25 15:12:43.065423"]]