rails/haris_ahmed_goal_tracker/app/views/users/show.html.erb


<% if @user.goals.empty? %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 1]]
SELECT  1 AS one FROM "goals" WHERE "goals"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

    <ul>
        <% @user.goals.each do |goal| %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 1]]