rails/haris_ahmed_goal_tracker/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "author_id", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "blah"], ["author_id", 1], ["commentable_id", 1], ["commentable_type", "User"], ["created_at", "2021-10-20 17:41:26.563959"], ["updated_at", "2021-10-20 17:41:26.563959"]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.author_id = current_user.id

        if @comment.save