rails/haris_ahmed_goal_tracker/app/controllers/goals_controller.rb

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @goal = Goal.find_by(id: params[:id])

INSERT INTO "goals" ("title", "details", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Goal2"], ["details", "jskdh"], ["user_id", 1], ["created_at", "2021-10-18 19:18:06.210376"], ["updated_at", "2021-10-18 19:18:06.210376"]]
---
    def create
        @goal = Goal.new(goal_params)
        @goal.user_id = current_user.id

        if @goal.save

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @goal = Goal.find_by(id: params[:id])

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "goals" SET "completed" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["completed", true], ["updated_at", "2021-10-18 20:06:49.563524"], ["id", 5]]
---
    def update
        @goal = Goal.find_by(id: params[:id])

        if @goal.update(goal_params)

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 2]]
---
    def destroy
        @goal = Goal.find_by(id: params[:id])

        if @goal
            @user_id = @goal.user_id
            @goal.destroy