rails/haris_ahmed_goal_tracker/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "activation_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
        @user = User.find_by(id: params[:id])

        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 273], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "patch_test"], ["updated_at", "2021-10-01 19:18:06.101981"], ["id", 273]]

    def destroy
        @user = User.find_by(id: params[:id])
        if @user
            @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 302], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 302]]