rails/haris_ahmed_99_cats/app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
    def new
        @cat_rental = CatRentalRequest.new
        @cats = Cat.all

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["start_date", "2020-07-05"], ["end_date", "2020-07-16"], ["created_at", "2021-08-05 14:46:57.846630"], ["updated_at", "2021-08-05 14:46:57.846630"]]
---
    def create
        @cat_rental = CatRentalRequest.new(rent_params)

        if @cat_rental.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def approve
        @cat_rental = CatRentalRequest.find_by(id: params[:id])