rails/haris_ahmed_reddit_clone/app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "body", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["body", "This is child for comment1"], ["created_at", "2021-11-10 15:14:30.371919"], ["updated_at", "2021-11-10 15:14:30.371919"], ["parent_comment_id", 1]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.user_id = current_user_id

        if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @comment = Comment.find_by(id: params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "user_votes" SET "value" = $1, "updated_at" = $2 WHERE "user_votes"."id" = $3  [["value", -1], ["updated_at", "2021-11-11 17:13:10.193144"], ["id", 2]]
---
    def vote(direction)
        @comment = Comment.find(params[:id])
        @user_vote = @comment.user_votes.find_or_initialize_by(user_id: current_user_id)

        unless @user_vote.update(value: direction)