rails/haris_ahmed_reddit_clone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id

        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test_post1"], ["url", "www.test.com"], ["content", "Blah Blah        "], ["author_id", 1], ["created_at", "2021-11-09 15:46:18.376783"], ["updated_at", "2021-11-09 15:46:18.376783"]]

    def update
        @post = Post.find_by(id: params[:id])

        if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "Blah Blah        \r\n        "], ["updated_at", "2021-11-09 15:52:12.162500"], ["id", 1]]

    def vote(direction)
        @post = Post.find(params[:id])
        @user_vote = @post.user_votes.find_or_initialize_by(user_id: current_user_id)

        unless @user_vote.update(value: direction)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "user_votes" SET "value" = $1, "updated_at" = $2 WHERE "user_votes"."id" = $3  [["value", -1], ["updated_at", "2021-11-11 17:09:33.271967"], ["id", 1]]