rails/haris_ahmed_reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "This is test sub        \r\n        "], ["updated_at", "2021-11-08 20:23:22.564803"], ["id", 1]]
---
    def update
        @sub = Sub.find_by(id: params[:id])

        if @sub.update(sub_params)